## Plan Result (ptl)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_user_assigned_identity.managed_identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "neuvector-cftptl-intsvc-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-cftptl-intsvc-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"ptl","Vars":{}} -->